
{"id":6,"date":"2014-12-17T02:51:30","date_gmt":"2014-12-17T02:51:30","guid":{"rendered":"http:\/\/www.derekdorr.net\/otisfield\/?page_id=6"},"modified":"2015-03-21T13:03:07","modified_gmt":"2015-03-21T13:03:07","slug":"archives","type":"page","link":"http:\/\/www.otisfield.org\/archives\/","title":{"rendered":"Archives"},"content":{"rendered":"<p>The archives of the Otisfield Historical Society are housed in the Sybil Lamb Archival Room at the Historical Society’s building, the Old Town House, 53 Bell Hill Road, Otisfield. Jean Hankins currently serves as archivist. <\/p>\n<p>At present the archives contain 72 separate collections, all housed in document boxes. In addition to the major collections, the archives contain about 200 “small collections,” which typically consist of only one or two folders. In addition to a limited number of important artifacts, among them Nathan Nutting’s planer, Hester Patch’s cross-stich sampler, and a friendship quilt made by ladies in the community, the collections consist of maps, deeds, record books, diaries, genealogies, letters, account books, newspaper clippings, some town records, and much more. <\/p>\n<p>Collection 17, named the Vertical File, contains photocopies of newspaper articles pertaining to Otisfield, some going back to the late 19th century. The obituaries in this collection are particularly important sources of information.<\/p>\n<p>Collection 40, the Pottle Family Collection, is one of our largest. It contains 10 boxes of letters written to and from Annette (Kemp) Pottle (1875 – 1958), who spent her entire life in Otisfield. The letters, which contain family news, comments on daily activities, and gossip about the neighbors, provide a fascinating glimpse of everyday life in Otisfield in the early 20th century when it was still a very small farming community where everyone did know everyone else. <\/p>\n<p>The archives are open to the public on Wednesday afternoons from 2-4, May through October, and by appointment. Jean Hankins, the archivist, can be reached at 207-539-2521 or jeanhankins@myfairpoint.net. The archives can be used only on site, but copies of most photographs or documents can be made. <\/p>\n"},"excerpt":{"rendered":"<p>The archives of the Otisfield Historical Society are housed in the Sybil Lamb Archival Room at the Historical Society’s building, the Old Town House, 53 Bell Hill Road, Otisfield. Jean Hankins currently serves as archivist. At present the archives contain 72 separate collections, all housed in document boxes. In addition to the major collections, the [&hellip;]<\/p>\n"},"author":1,"featured_image":0,"parent":0,"menu_order":0,"comment_status":"open","ping_status":"open","template":"archive.php","_links":{"self":[{"href":"http:\/\/www.otisfield.org\/wp-json\/wp\/v2\/pages\/6"}],"collection":[{"href":"http:\/\/www.otisfield.org\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"http:\/\/www.otisfield.org\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"http:\/\/www.otisfield.org\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"http:\/\/www.otisfield.org\/wp-json\/wp\/v2\/comments?post=6"}],"version-history":[{"href":"http:\/\/www.otisfield.org\/wp-json\/wp\/v2\/pages\/6\/revisions"}],"https:\/\/api.w.org\/attachment":[{"href":"http:\/\/www.otisfield.org\/wp-json\/wp\/v2\/media?parent=6"}],"https:\/\/api.w.org\/meta":[{"embeddable":true,"href":"http:\/\/www.otisfield.org\/wp-json\/wp\/v2\/pages\/6\/meta"}]}}